src/data_analysis/collected_data/orange/api/standarda8v2/g/load_read.txt
Running 30m test @ http://20.108.163.124:60/wrk2-api/home-timeline/read
  2 threads and 1000 connections
  Thread calibration: mean lat.: 778.225ms, rate sampling interval: 3839ms
  Thread calibration: mean lat.: 746.068ms, rate sampling interval: 3604ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.24m     6.57m   22.56m    57.94%
    Req/Sec   120.81     10.93   150.00     77.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.19m 
 75.000%   16.91m 
 90.000%   20.36m 
 99.000%   22.56m 
 99.900%   23.21m 
 99.990%   23.63m 
 99.999%   24.06m 
100.000%   24.15m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     738.303     0.000000            1         1.00
  129105.919     0.100000        43420         1.11
  265945.087     0.200000        86821         1.25
  403177.471     0.300000       130263         1.43
  540016.639     0.400000       173721         1.67
  671612.927     0.500000       217112         2.00
  739770.367     0.550000       238869         2.22
  809500.671     0.600000       260620         2.50
  876609.535     0.650000       282306         2.86
  945815.551     0.700000       303996         3.33
 1014497.279     0.750000       325577         4.00
 1048575.999     0.775000       336512         4.44
 1084227.583     0.800000       347555         5.00
 1118830.591     0.825000       358400         5.71
 1152385.023     0.850000       369039         6.67
 1186988.031     0.875000       379957         8.00
 1204813.823     0.887500       385545         8.89
 1221591.039     0.900000       390863        10.00
 1239416.831     0.912500       396418        11.43
 1256194.047     0.925000       401613        13.33
 1274019.839     0.937500       407196        16.00
 1282408.447     0.943750       409953        17.78
 1290797.055     0.950000       412577        20.00
 1299185.663     0.956250       415240        22.86
 1307574.271     0.962500       417884        26.67
 1317011.455     0.968750       420735        32.00
 1321205.759     0.971875       421943        35.56
 1326448.639     0.975000       423440        40.00
 1330642.943     0.978125       424587        45.71
 1336934.399     0.981250       426157        53.33
 1342177.279     0.984375       427438        64.00
 1345323.007     0.985938       428098        71.11
 1348468.735     0.987500       428790        80.00
 1351614.463     0.989062       429410        91.43
 1355808.767     0.990625       430171       106.67
 1358954.495     0.992188       430728       128.00
 1361051.647     0.992969       431073       142.22
 1364197.375     0.993750       431461       160.00
 1366294.527     0.994531       431732       182.86
 1369440.255     0.995313       432077       213.33
 1372585.983     0.996094       432432       256.00
 1374683.135     0.996484       432625       284.44
 1375731.711     0.996875       432724       320.00
 1378877.439     0.997266       432956       365.71
 1380974.591     0.997656       433118       426.67
 1383071.743     0.998047       433241       512.00
 1385168.895     0.998242       433356       568.89
 1386217.471     0.998437       433408       640.00
 1388314.623     0.998633       433524       731.43
 1390411.775     0.998828       433611       853.33
 1392508.927     0.999023       433672      1024.00
 1393557.503     0.999121       433708      1137.78
 1395654.655     0.999219       433764      1280.00
 1396703.231     0.999316       433784      1462.86
 1398800.383     0.999414       433840      1706.67
 1400897.535     0.999512       433876      2048.00
 1401946.111     0.999561       433892      2275.56
 1404043.263     0.999609       433919      2560.00
 1405091.839     0.999658       433932      2925.71
 1407188.991     0.999707       433960      3413.33
 1409286.143     0.999756       433984      4096.00
 1410334.719     0.999780       433995      4551.11
 1411383.295     0.999805       434006      5120.00
 1411383.295     0.999829       434006      5851.43
 1413480.447     0.999854       434020      6826.67
 1416626.175     0.999878       434031      8192.00
 1417674.751     0.999890       434040      9102.22
 1417674.751     0.999902       434040     10240.00
 1419771.903     0.999915       434043     11702.86
 1422917.631     0.999927       434049     13653.33
 1425014.783     0.999939       434055     16384.00
 1427111.935     0.999945       434058     18204.44
 1428160.511     0.999951       434061     20480.00
 1429209.087     0.999957       434063     23405.71
 1434451.967     0.999963       434065     27306.67
 1435500.543     0.999969       434067     32768.00
 1437597.695     0.999973       434069     36408.89
 1439694.847     0.999976       434070     40960.00
 1441791.999     0.999979       434072     46811.43
 1442840.575     0.999982       434074     54613.33
 1442840.575     0.999985       434074     65536.00
 1443889.151     0.999986       434076     72817.78
 1443889.151     0.999988       434076     81920.00
 1443889.151     0.999989       434076     93622.86
 1445986.303     0.999991       434077    109226.67
 1445986.303     0.999992       434077    131072.00
 1447034.879     0.999993       434078    145635.56
 1447034.879     0.999994       434078    163840.00
 1447034.879     0.999995       434078    187245.71
 1449132.031     0.999995       434080    218453.33
 1449132.031     1.000000       434080          inf
#[Mean    =   674449.914, StdDeviation   =   394162.258]
#[Max     =  1448083.456, Total count    =       434080]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  440691 requests in 30.00m, 5.85GB read
  Socket errors: connect 0, read 11285, write 19092, timeout 121490
  Non-2xx or 3xx responses: 155
Requests/sec:    244.83
Transfer/sec:      3.33MB